In [1]:
import pandas as pd
import numpy as np

In [3]:
data_records = [["Alan", 22, 9, 7, 8, 6, 9],
                ["Casey", 21, 8, 7, 7, 8, 6],
                ["Tyson", 25, 10, 9, 10, 8, 7],
                ["Albert", 20, 7, 7, 6, 5, 8],
                ["Carol", 23, 8, 8, 8, 8, 8]]

columns = ["Name", "Age", "Mathematics", "Statistics", "Physics", "Chemistry", "Computing"]

In [4]:
df = pd.DataFrame(data=data_records, columns=columns)

In [5]:
df.head(

SyntaxError: incomplete input (2846517621.py, line 1)

In [6]:
df.head()

     Name  Age  Mathematics  Statistics  Physics  Chemistry  Computing
0    Alan   22            9           7        8          6          9
1   Casey   21            8           7        7          8          6
2   Tyson   25           10           9       10          8          7
3  Albert   20            7           7        6          5          8
4   Carol   23            8           8        8          8          8

In [7]:
df.Mathematics

0     9
1     8
2    10
3     7
4     8
Name: Mathematics, dtype: int64

In [8]:
df['Mathematics']

0     9
1     8
2    10
3     7
4     8
Name: Mathematics, dtype: int64

In [9]:
df[['Name', 'Age', 'Physics']]

     Name  Age  Physics
0    Alan   22        8
1   Casey   21        7
2   Tyson   25       10
3  Albert   20        6
4   Carol   23        8

In [10]:
df['History']=[5, 6, 4, 7, 9]

In [11]:
df.head()

,Name,Age,Mathematics,Statistics,Physics,Chemistry,Computing,History
0,Alan,22,9,7,8,6,9,5
1,Casey,21,8,7,7,8,6,6
2,Tyson,25,10,9,10,8,7,4
3,Albert,20,7,7,6,5,8,7
4,Carol,23,8,8,8,8,8,9

In [12]:
del df['History']

In [13]:
df.head()

     Name  Age  Mathematics  Statistics  Physics  Chemistry  Computing
0    Alan   22            9           7        8          6          9
1   Casey   21            8           7        7          8          6
2   Tyson   25           10           9       10          8          7
3  Albert   20            7           7        6          5          8
4   Carol   23            8           8        8          8          8

In [14]:
df.drop(['Chemistry', 'Physics'], axis=1, inplace=True)

In [15]:
df.head()

     Name  Age  Mathematics  Statistics  Computing
0    Alan   22            9           7          9
1   Casey   21            8           7          6
2   Tyson   25           10           9          7
3  Albert   20            7           7          8
4   Carol   23            8           8          8

In [16]:
df.loc[[1,2,4], ['Name', 'Mathematics']]

    Name  Mathematics
1  Casey            8
2  Tyson           10
4  Carol            8

In [17]:
df.loc[1]

Name           Casey
Age               21
Mathematics        8
Statistics         7
Computing          6
Name: 1, dtype: object

In [19]:
df1 = df.copy()
df1.index = ['a','b','c','d','e']
df1.loc[['a', 'b', 'd']]

     Name  Age  Mathematics  Statistics  Computing
a    Alan   22            9           7          9
b   Casey   21            8           7          6
d  Albert   20            7           7          8

In [22]:
(df['Statistics'] + df.Mathematics) / 2

0    8.0
1    7.5
2    9.5
3    7.0
4    8.0
dtype: float64

In [23]:
df

     Name  Age  Mathematics  Statistics  Computing
0    Alan   22            9           7          9
1   Casey   21            8           7          6
2   Tyson   25           10           9          7
3  Albert   20            7           7          8
4   Carol   23            8           8          8

In [27]:
df['Computing'] >= 7

0     True
1    False
2     True
3     True
4     True
Name: Computing, dtype: bool

In [28]:
df[df['Computing'] >= 7]

     Name  Age  Mathematics  Statistics  Computing
0    Alan   22            9           7          9
2   Tyson   25           10           9          7
3  Albert   20            7           7          8
4   Carol   23            8           8          8

In [29]:
df[df['Computing'] >= 7]['Age']

0    22
2    25
3    20
4    23
Name: Age, dtype: int64

In [33]:
df[df['Name'] == 'Alan']

   Name  Age  Mathematics  Statistics  Computing
0  Alan   22            9           7          9

In [34]:
df['Name'].apply(lambda x: "Student " + x)

0      Student Alan
1     Student Casey
2     Student Tyson
3    Student Albert
4     Student Carol
Name: Name, dtype: object